In [1]:
import pandas as pd

In [2]:
people = {
    "이름" : ["GIL", "CHUN", "MONG"],
    "성" : ["HONG", "SUNG", "LEE"],
    "이메일" : ["gdhong@gmail.com", "chsung@gmail.com", "mrlee@gmail.com"]
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

     이름     성               이메일
0   GIL  HONG  gdhong@gmail.com
1  CHUN  SUNG  chsung@gmail.com
2  MONG   LEE   mrlee@gmail.com

In [5]:
df.columns

Index(['이름', '성', '이메일'], dtype='object')

In [6]:
df.columns = ['first_name', 'last_name', 'email']

In [7]:
df

  first_name last_name             email
0        GIL      HONG  gdhong@gmail.com
1       CHUN      SUNG  chsung@gmail.com
2       MONG       LEE   mrlee@gmail.com

In [8]:
col_arr = [x for x in df.columns]

In [9]:
col_arr

['first_name', 'last_name', 'email']

In [10]:
arr = [x for x in range(1,10,2)]

In [11]:
arr

[1, 3, 5, 7, 9]

In [12]:
col_arr = [x.upper() for x in df.columns]

In [13]:
col_arr

['FIRST_NAME', 'LAST_NAME', 'EMAIL']

In [14]:
df.columns = col_arr

In [15]:
df

  FIRST_NAME LAST_NAME             EMAIL
0        GIL      HONG  gdhong@gmail.com
1       CHUN      SUNG  chsung@gmail.com
2       MONG       LEE   mrlee@gmail.com

In [16]:
df.columns = [x.replace('_', ' ') for x in df.columns]

In [17]:
df

  FIRST NAME LAST NAME             EMAIL
0        GIL      HONG  gdhong@gmail.com
1       CHUN      SUNG  chsung@gmail.com
2       MONG       LEE   mrlee@gmail.com

In [18]:
df.columns.str.replace(' ', '_')

Index(['FIRST_NAME', 'LAST_NAME', 'EMAIL'], dtype='object')

In [19]:
df

  FIRST NAME LAST NAME             EMAIL
0        GIL      HONG  gdhong@gmail.com
1       CHUN      SUNG  chsung@gmail.com
2       MONG       LEE   mrlee@gmail.com

In [20]:
df.columns = df.columns.str.replace(' ', '_')

In [21]:
df

  FIRST_NAME LAST_NAME             EMAIL
0        GIL      HONG  gdhong@gmail.com
1       CHUN      SUNG  chsung@gmail.com
2       MONG       LEE   mrlee@gmail.com

In [22]:
df.rename(columns={"FIRST_NAME" : "first", "LAST_NAME" : "last"}, inplace=True)

In [23]:
df

  first  last             EMAIL
0   GIL  HONG  gdhong@gmail.com
1  CHUN  SUNG  chsung@gmail.com
2  MONG   LEE   mrlee@gmail.com

In [24]:
df.loc[2]

first               MONG
last                 LEE
EMAIL    mrlee@gmail.com
Name: 2, dtype: object

In [25]:
df.loc[2, 'first']

'MONG'

In [26]:
df.loc[2] = ['몽룡', '이', 'melee@yju.ac.kr']

In [27]:
df

  first  last             EMAIL
0   GIL  HONG  gdhong@gmail.com
1  CHUN  SUNG  chsung@gmail.com
2    몽룡     이   melee@yju.ac.kr

In [28]:
df.loc[2,['last','EMAIL']]

last                   이
EMAIL    melee@yju.ac.kr
Name: 2, dtype: object

In [29]:
df.loc[2,['last','EMAIL']] = ['Lee', 'mrlee@gmail.com']

In [30]:
df

  first  last             EMAIL
0   GIL  HONG  gdhong@gmail.com
1  CHUN  SUNG  chsung@gmail.com
2    몽룡   Lee   mrlee@gmail.com

In [31]:
df.rename(columns={'EMAIL' : 'email'}, inplace=True)

In [32]:
df

  first  last             email
0   GIL  HONG  gdhong@gmail.com
1  CHUN  SUNG  chsung@gmail.com
2    몽룡   Lee   mrlee@gmail.com

In [33]:
df['email'] == 'mrlee@gmail.com'

0    False
1    False
2     True
Name: email, dtype: bool

In [34]:
df[df['email'] == 'mrlee@gmail.com']

  first last            email
2    몽룡  Lee  mrlee@gmail.com

In [35]:
filt = df['email'] == 'mrlee@gmail.com'

In [36]:
df[filt]

  first last            email
2    몽룡  Lee  mrlee@gmail.com

In [37]:
filt = df['first'] == '몽룡'
df.loc[filt,['last','email']] = ['Park','mrpark@gmail.com']
df

  first  last             email
0   GIL  HONG  gdhong@gmail.com
1  CHUN  SUNG  chsung@gmail.com
2    몽룡  Park  mrpark@gmail.com

In [38]:
type(df['email'])

pandas.core.series.Series

In [39]:
type(df[['email','last']])

pandas.core.frame.DataFrame

In [40]:
df['last'].str.upper()

0    HONG
1    SUNG
2    PARK
Name: last, dtype: object

In [41]:
df

  first  last             email
0   GIL  HONG  gdhong@gmail.com
1  CHUN  SUNG  chsung@gmail.com
2    몽룡  Park  mrpark@gmail.com

In [42]:
filt = df['last']

In [43]:
filt = filt.str.upper()

In [44]:
df['last'] = df['last'].str.upper()

In [45]:
df

  first  last             email
0   GIL  HONG  gdhong@gmail.com
1  CHUN  SUNG  chsung@gmail.com
2    몽룡  PARK  mrpark@gmail.com

In [46]:
df['last'].str.len()

0    4
1    4
2    4
Name: last, dtype: int64

In [47]:
df['last'].str.len()

0    4
1    4
2    4
Name: last, dtype: int64

apple()함수는 def 함수 이름():
함수구현

In [48]:
def upper(strval) : 
    return strval.upper()
def lower(strval) :
    return strval.lower()

In [49]:
df['last'].apply(upper)

0    HONG
1    SUNG
2    PARK
Name: last, dtype: object

In [50]:
df['last'].apply(lower)

0    hong
1    sung
2    park
Name: last, dtype: object

In [51]:
df

  first  last             email
0   GIL  HONG  gdhong@gmail.com
1  CHUN  SUNG  chsung@gmail.com
2    몽룡  PARK  mrpark@gmail.com

In [52]:
df['last'] = df['last'].apply(lower)

In [53]:
df

  first  last             email
0   GIL  hong  gdhong@gmail.com
1  CHUN  sung  chsung@gmail.com
2    몽룡  park  mrpark@gmail.com

In [54]:
n1 =3
n2 = 5
n2, n1 = n1, n2
n2

3

In [55]:
n1

5

In [56]:
arr1 = [1,2,3,4]
arr2 = [4,3,2,1]
arr1,arr2 = arr2,arr1

In [57]:
arr1

[4, 3, 2, 1]

In [58]:
arr2

[1, 2, 3, 4]

In [59]:
df

  first  last             email
0   GIL  hong  gdhong@gmail.com
1  CHUN  sung  chsung@gmail.com
2    몽룡  park  mrpark@gmail.com

In [60]:
df['email'],df ['last'] = df['last'],df['email']

In [61]:
df

  first  last email
0   GIL  hong  hong
1  CHUN  sung  sung
2    몽룡  park  park

In [62]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [63]:
import numpy as np

In [64]:
df.loc[3] = ['chunhyang', None,'chsung@gmail.com']

In [65]:
df.apply(len)

first    4
last     4
email    4
dtype: int64

In [66]:
df

       first  last             email
0        GIL  hong              hong
1       CHUN  sung              sung
2         몽룡  park              park
3  chunhyang  None  chsung@gmail.com

In [67]:
df['last'].count

<bound method Series.count of 0    hong
1    sung
2    park
3    None
Name: last, dtype: object>

In [68]:
df['first'].count

<bound method Series.count of 0          GIL
1         CHUN
2           몽룡
3    chunhyang
Name: first, dtype: object>

select count(name) from members
sql에서도 name 칼럼 값이 null이면 카운팅에서 제외된다.
즉 members 테이블에 5개의 레코드가 있어도, 특정 하나의 레코드의 name 칼럼값이 null이면 위 sql 문의 결과는 4가 반환된다.
이처럼, count() 마찬가지다.

select count ( * ) from members;

In [69]:
df.apply(len)

first    4
last     4
email    4
dtype: int64

In [70]:
df.apply(len, axis = 'columns')

0    3
1    3
2    3
3    3
dtype: int64

In [71]:
df.apply(len, axis = 'index')

first    4
last     4
email    4
dtype: int64

In [72]:
df

       first  last             email
0        GIL  hong              hong
1       CHUN  sung              sung
2         몽룡  park              park
3  chunhyang  None  chsung@gmail.com

In [73]:
df.loc[3,'last'] = 'Sung'

In [74]:
df

       first  last             email
0        GIL  hong              hong
1       CHUN  sung              sung
2         몽룡  park              park
3  chunhyang  Sung  chsung@gmail.com

In [75]:
df.apply(min)

first                CHUN
last                 Sung
email    chsung@gmail.com
dtype: object

In [76]:
df

       first  last             email
0        GIL  hong              hong
1       CHUN  sung              sung
2         몽룡  park              park
3  chunhyang  Sung  chsung@gmail.com

In [77]:
df.apply(min)

first                CHUN
last                 Sung
email    chsung@gmail.com
dtype: object

In [78]:
df['email'].apply(min)

0    g
1    g
2    a
3    .
Name: email, dtype: object

In [79]:
df.apply(min)

first                CHUN
last                 Sung
email    chsung@gmail.com
dtype: object

In [80]:
df.apply(lambda x:x.min())

first                CHUN
last                 Sung
email    chsung@gmail.com
dtype: object

위에서 람다는 각 시리즈에 대해서 적용 된다

따라서x는 각 시리즈를 의미한다

DataFrame의 모든 값에 대해 특정 함수를 적용 하기 위해서는 applymap()을 사용한다

applymap()은 DataFrame에만 적용 할 수 있다

In [82]:
df.apply(len)

first    4
last     4
email    4
dtype: int64

In [83]:
df.applymap(len)

   first  last  email
0      3     4      4
1      4     4      4
2      2     4      4
3      9     4     16

In [84]:
df

       first  last             email
0        GIL  hong              hong
1       CHUN  sung              sung
2         몽룡  park              park
3  chunhyang  Sung  chsung@gmail.com

map()함수를 살펴보다
map()은 시리즈의 각 값을 치환하기 위해 사용 될 수 있다

In [87]:
df['first']

0          GIL
1         CHUN
2           몽룡
3    chunhyang
Name: first, dtype: object

In [90]:
df['first'].map({'GIL' : '길동', 'CHUN' : '춘향'})

0     길동
1     춘향
2    NaN
3    NaN
Name: first, dtype: object

In [91]:
df

       first  last             email
0        GIL  hong              hong
1       CHUN  sung              sung
2         몽룡  park              park
3  chunhyang  Sung  chsung@gmail.com

In [92]:
df['first'].replace({'GIL' : '길동', 'CHUN' : '춘향'})

0           길동
1           춘향
2           몽룡
3    chunhyang
Name: first, dtype: object

In [94]:
df['first'] = df['first'].replace({'GIL' : '길동', 'CHUN' : '춘향'})

In [95]:
df

       first  last             email
0         길동  hong              hong
1         춘향  sung              sung
2         몽룡  park              park
3  chunhyang  Sung  chsung@gmail.com

In [98]:
df['first'] = df['first'].replace({'chunhyang' : '향단'})

In [100]:
df

  first  last             email
0    길동  hong              hong
1    춘향  sung              sung
2    몽룡  park              park
3    향단  Sung  chsung@gmail.com